openfoam/dentalRoom2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2-D dental treatment room: 4.0 m (x) x 3.0 m (y) x 0.01 m (z, pseudo-2D).
// Domain is split into four x-slabs at x = 1, 2, 3 so that the top and
// bottom patches can be cleanly partitioned into airInlet / airOutlet /
// wall strips without needing faceSet.
//
// NOTE: in foam-extend 4.1, blockMesh reads from constant/polyMesh/ by
// default (not from system/ as in OpenFOAM.org >= 4).

convertToMeters 1.0;

vertices
(
    // front plane (z = 0) --------------------------------------------------
    (0.0  0.0  0.000)   //  0
    (1.0  0.0  0.000)   //  1
    (2.0  0.0  0.000)   //  2
    (3.0  0.0  0.000)   //  3
    (4.0  0.0  0.000)   //  4
    (0.0  3.0  0.000)   //  5
    (1.0  3.0  0.000)   //  6
    (2.0  3.0  0.000)   //  7
    (3.0  3.0  0.000)   //  8
    (4.0  3.0  0.000)   //  9

    // back plane (z = 0.01) duplicates -------------------------------------
    (0.0  0.0  0.010)   // 10
    (1.0  0.0  0.010)   // 11
    (2.0  0.0  0.010)   // 12
    (3.0  0.0  0.010)   // 13
    (4.0  0.0  0.010)   // 14
    (0.0  3.0  0.010)   // 15
    (1.0  3.0  0.010)   // 16
    (2.0  3.0  0.010)   // 17
    (3.0  3.0  0.010)   // 18
    (4.0  3.0  0.010)   // 19
);

// Four x-slabs, one cell thick in z.  Cell counts below give ~ 22 500 cells.
blocks
(
    hex ( 0  1  6  5  10 11 16 15) (25 150 1) simpleGrading (1 1 1)   // [0,1]
    hex ( 1  2  7  6  11 12 17 16) (25 150 1) simpleGrading (1 1 1)   // [1,2]
    hex ( 2  3  8  7  12 13 18 17) (25 150 1) simpleGrading (1 1 1)   // [2,3]
    hex ( 3  4  9  8  13 14 19 18) (25 150 1) simpleGrading (1 1 1)   // [3,4]
);

edges
(
);

patches
(
    patch airOutlet
    (
        ( 0  1 11 10)   // bottom, x in [0,1]
    )

    wall floor
    (
        ( 1  2 12 11)   // bottom, x in [1,2]
        ( 2  3 13 12)   // bottom, x in [2,3]
        ( 3  4 14 13)   // bottom, x in [3,4]
    )

    wall ceiling
    (
        ( 5  6 16 15)   // top, x in [0,1]
        ( 6  7 17 16)   // top, x in [1,2]
        ( 8  9 19 18)   // top, x in [3,4]
    )

    patch airInlet
    (
        ( 7  8 18 17)   // top, x in [2,3]
    )

    wall leftWall
    (
        ( 0  5 15 10)
    )

    wall rightWall
    (
        ( 4  9 19 14)
    )

    empty frontAndBack
    (
        ( 0  1  6  5)   // front
        ( 1  2  7  6)
        ( 2  3  8  7)
        ( 3  4  9  8)
        (10 11 16 15)   // back
        (11 12 17 16)
        (12 13 18 17)
        (13 14 19 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
