openfoam/dentalRoom2D/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// foam-extend 4.1 old-style format:
//   thermoType  <single primitive string>;
//   mixture     <name> <nMoles> <molWeight> <Cp> <Hf> <mu> <Pr>;
//
// Token order for pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>:
//   name   nMoles  molWeight   Cp     Hf     mu        Pr
//   air    1       28.9        1007   0      1.8e-05   0.713

thermoType  hPsiThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

mixture     air  1  28.9  1007  0  1.8e-05  0.713;

// ************************************************************************* //
