openfoam/dentalRoom2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Carrier phase: air at room temperature.
transportModel  Newtonian;

nu              nu  [0 2 -1 0 0 0 0]  1.5e-05;
rho             rho [1 -3 0 0 0 0 0]  1.2;

// ************************************************************************* //
