openfoam/dentalRoom2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// uncoupledKinematicParcelFoam uses hPsiThermo (compressible, basicPsiThermo
// family).  The pressure field must be absolute pressure [Pa] so that the
// perfect-gas EOS rho = p/(R*T) returns a non-zero density.
// At 101325 Pa and 300 K, air density ~ 1.177 kg/m^3.

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    airInlet
    {
        type            zeroGradient;
    }
    airOutlet
    {
        // Fixed absolute pressure reference at the extraction grille.
        type            fixedValue;
        value           uniform 101325;
    }
    floor           { type zeroGradient; }
    ceiling         { type zeroGradient; }
    leftWall        { type zeroGradient; }
    rightWall       { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
