openfoam/dentalRoom2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airInlet        { type calculated;             value uniform 0; }
    airOutlet       { type calculated;             value uniform 0; }
    floor           { type nutkWallFunction;       value uniform 0; }
    ceiling         { type nutkWallFunction;       value uniform 0; }
    leftWall        { type nutkWallFunction;       value uniform 0; }
    rightWall       { type nutkWallFunction;       value uniform 0; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
