openfoam/dentalRoom2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    airOutlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    floor
    {
        type            compressible::omegaWallFunction;
        refValue        uniform 0;
        value           uniform 1;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    ceiling
    {
        type            compressible::omegaWallFunction;
        refValue        uniform 0;
        value           uniform 1;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    airInlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    leftWall
    {
        type            compressible::omegaWallFunction;
        refValue        uniform 0;
        value           uniform 1;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    rightWall
    {
        type            compressible::omegaWallFunction;
        refValue        uniform 0;
        value           uniform 1;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
