openfoam/dentalRoom2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|    =========                 |                                              |
|    \\      /  F ield         | foam-extend: Open Source CFD                 |
|     \\    /   O peration     | Version:     4.1                             |
|      \\  /    A nd           | Web:         http://www.foam-extend.org      |
|       \\/     M anipulation  |                                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    "(k|omega|epsilon)"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.01;
    }

    "(k|omega|epsilon)Final"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors        2;
    nCorrectors             2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor       yes;
}

relaxationFactors
{
    fields
    {
        p       0.3;
    }
    equations
    {
        "U.*"       0.7;
        "k.*"       0.7;
        "omega.*"   0.7;
    }
}

// ************************************************************************* //
