openfoam/dentalRoom2D/Allrun
#!/bin/sh
# Run the 2D dental-room nanoparticle dispersion case end-to-end.
# Source the foam-extend 4.1 environment before running, e.g.:
#   source $FOAM_INST_DIR/foam-extend-4.1/etc/bashrc

cd "${0%/*}" || exit 1
. "${WM_PROJECT_DIR:?WM_PROJECT_DIR not set -- source foam-extend 4.1 first}/bin/tools/RunFunctions"

# ----------------------------------------------------------------------------
# 1. Mesh
# ----------------------------------------------------------------------------
runApplication blockMesh
runApplication checkMesh

# ----------------------------------------------------------------------------
# 2. Transient flow + one-way coupled Lagrangian cloud
#    uncoupledKinematicParcelFoam solves U/p/k/omega/nut with PIMPLE and
#    tracks parcels alongside, without feedback from particles to the fluid.
# ----------------------------------------------------------------------------
runApplication $(getApplication)

# ----------------------------------------------------------------------------
# 3. Post-process to VTK for downstream ML pipeline
# ----------------------------------------------------------------------------
runApplication foamToVTK -latestTime
runApplication -s lagrangian foamToVTK -latestTime -lagrangianFields '(U d active origId)'

echo ""
echo "Case complete."
echo "  Eulerian fields:  VTK/"
echo "  Parcel tracks:    VTK/lagrangian/kinematicCloud/"
